package rst.util;

public enum ResultCode {
	//开户
	CustctSuccess("00000","开户成功"),CustctFailed("99999","开户失败"),CustctRepeat("99991","重复开户"),
	//e账户开户
	EctcrSuccess("00000","开户成功"),EctcrFailed("99999","开户失败"),EctcrRepeat("99991","重复开户"),
	//代付
	McltSuccess("0000","代付成功"),McltFailed("2001","交易失败"),McltRepeat("2012","重复交易"),
	//授信
	CreditSuccess("00000","授信成功"),CreditFailed("99999","授信失败"),CreditNoCustct("99991","未开户"),CreditNoExpire("99992","存在未到期授信"),
	//放款 
	LoanpySuccess("00000","放款成功"),LoanpyFailed("99999","放款失败"),
	//还款计划查询
	QyrpplSuccess("00000","查询还款计划成功"),QurpplFailed("99999","查询还款计划失败"),
	//保证金、结算账户查询
	BosaqySuccess("00000","保证金/结算账户流水查询成功"),BosaqyFailed("99999","保证金/结算账户流水查询失败"),
	
	//人脸识别认证
	FacechkSuccess("0000","人脸认证查询返回成功"),FacechkFailed("2006","系统繁忙，请稍后再试"),  
	F1("-7","系统错误或服务异常 如连接超时、公安部系统异常等情况，解决办法是重新请求"),F9("-0","姓名和身份证号码一致"),F8("-5","不一致 身份证号码不存在，或者身份证号码和姓名不匹配"),F19("-X","未执行"),
	F10("-0","同一人"),F11("3","同一人"),F12("-1","非同一人  可能出现的原因：1、照片为本人，但是照片可能有角度、光线过暗、脸部区域有亮斑 2、照片为本人，但是该照片尺寸太小"),F13("4","非同一人  可能出现的原因：1、照片为本人，但是照片可能有角度、光线过暗、脸部区域有亮斑 2、照片为本人，但是该照片尺寸太小"),
	F14("-2","疑似  可能出现的原因：1、照片为本人，但是照片可能有角度、光线过暗、脸部区域有亮斑 2、照片为本人，但是该照片尺寸太小 3、两人长相类似"),F15("5","疑似  可能出现的原因：1、照片为本人，但是照片可能有角度、光线过暗、脸部区域有亮斑 2、照片为本人，但是该照片尺寸太小 3、两人长相类似"),
	F16("-9","未提供照片 使用带人像的认证模式，但未提供照片数据"),F17("-J","现场照片小于 5K 字节"),F18("-K","公安制证照片或人口小于 5K 字节"),
	F2("-A","人像比对数据库操作异常"),F3("-B","人像比对异常"),F4("-E","图像格式不支持 非 JPEG格式的图像"),F5("-F","待比对图像建模失败 可能出现的因:1、照片可能有角度、光线过暗、脸部区域有亮斑、模糊 2、照片尺寸太小"),F6("-G","身份证照片模板不存在"),F7("-W","系统其他错误"),
	
	//代收结果查询
	MctlqrSuccess("0000","代收结果查询返回成功"),MctlqrFailed("2006","系统繁忙，请稍后再试"),
	//代付结果查询
	MpayqrSuccess("0000","代付结果查询返回成功"),MpayqrFailed("2006","系统繁忙，请稍后再试"),
	
	//代收
	MpaySuccess("0000","成功"),MpayFailed("2006","系统繁忙，请稍后再试"),
	//实名
	IdchkSuccess("0000","成功"),IdchkFailed("2006","系统繁忙，请稍后再试"),
	//批量代收
	BatchMpaySuccess("0000","代收返回成功"),BatchMpayFailed("2006","系统繁忙，请稍后再试"),
	
	CmrpcsSuccess("0000","成功"),CmrpcsFailed("2006","系统繁忙，请稍后再试"),
	
	F20("2006","系统繁忙，请稍后再试"),
	F21("2002","系统未开放或暂时关闭，请稍后再试"), 
	F22("2001","交易失败。详情请银询 95516"), 
	F23("1399","后台系统未知错误"),
	F24("1308","银行受理成功"), 
	F25("1306","交易失败，详情请咨询您的发卡行"),  
	F26("1301","交易失败，结果不确定"),   
	F27("1302","交易通讯超时"),   
	F28("1304","重复交易"),   
	F29("1305","查无此交易"),  
	F30("1005","交易已受理，请稍后查询交易结果"),  
	F31("1003","交易通讯超时，请发起査询交易"),   
	F32("1004","交易状态未明，请査询对账结果"),  
	F33("1000","受理成功，待处理"),  
	F34("2034","查无此交易"),  
	F35("2037","已超过最大査询次数或操作过于频繁"),  
	F36("2208","系统异常"),   
	F37("2209","查询失败"),  
	F38("2330","交易已撤销"), 
	F39("1399","后台系统未知错误"),
	F40("2314","查无此账户") 
	;
	//构造枚举值  
     private ResultCode(String code,String message){  
      this.code=code;  
      this.message=message;  
     }  

     public String toString(){  //覆盖了父类Enum的toString()  
    	 return super.toString()+"("+code+"："+message+")";
    
     }  

     private String code;  //自定义数据域，private为了封装。  
     private String message;
	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}

	public String getMessage() {
		return message;
	}

	public void setMessage(String message) {
		this.message = message;
	}  
}
